; domain
(define (domain blocksworld)
(:predicates (clear ?x)
             (ontable ?x)
             (on ?x ?y))

(:action move-b-to-b
  :parameters (?bm ?bf ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (on ?bm ?bf))
  :effect (and (not (clear ?bt)) (not (on ?bm ?bf))
               (on ?bm ?bt) (clear ?bf)))

(:action move-b-to-t
  :parameters (?bm ?bf)
  :precondition (and (clear ?bm) (on ?bm ?bf))
  :effect (and (not (on ?bm ?bf))
               (ontable ?bm) (clear ?bf)))

(:action move-t-to-b
  :parameters (?bm ?bt)
  :precondition (and (clear ?bm) (clear ?bt) (ontable ?bm))
  :effect (and (not (clear ?bt)) (not (ontable ?bm))
               (on ?bm ?bt))))

; problem
(define (problem BW-rand-9)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 )
(:init
(ontable b1)
(on b2 b1)
(on b3 b4)
(ontable b4)
(ontable b5)
(on b6 b2)
(ontable b7)
(on b8 b3)
(on b9 b5)
(clear b6)
(clear b7)
(clear b8)
(clear b9)
)
(:goal
(and
(on b1 b8)
(on b2 b9)
(on b3 b4)
(on b7 b1)
(on b8 b3)
(on b9 b7))
)
)

; plan
1. (move-b-to-t b6 b2)
   deleted: (on b6 b2)
   added: (ontable b6) (clear b2)
   goals met: 2 of 6
2. (move-b-to-b b2 b1 b6)
   deleted: (clear b6) (on b2 b1)
   added: (on b2 b6) (clear b1)
   goals met: 2 of 6
3. (move-t-to-b b1 b8)
   deleted: (clear b8) (ontable b1)
   added: (on b1 b8)
   goals met: 3 of 6
4. (move-t-to-b b7 b1)
   deleted: (clear b1) (ontable b7)
   added: (on b7 b1)
   goals met: 4 of 6
5. (move-b-to-b b9 b5 b7)
   deleted: (clear b7) (on b9 b5)
   added: (on b9 b7) (clear b5)
   goals met: 5 of 6
6. (move-b-to-b b2 b6 b9)
   deleted: (clear b9) (on b2 b6)
   added: (on b2 b9) (clear b6)
   goals met: 6 of 6
